Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Take care when using patterns that include C<\G> in an alternation.
es_es: Tenga cuidado al utilizar patrones que incluyan C<\G> en una alternativa.

source: This makes it much easier for tools such as web browsers to wrap it, but might confuse any automatic tools which perform detailed parsing of Carp output.
es_es: Esto hace que sea mucho más fácil para las herramientas como los navegadores web para ajustar la presentación, pero podría confundir a cualquier herramienta automática que llevase a cabo un análisis detallado de la salida de Carp.

source: It's reasonably easy to understand, and almost everything that applies here will also be applicable later on with the fancier data structures.
es_es: Es razonablemente fácil de entender, y casi todo lo que se aplica aquí también se aplicará más tarde con las estructuras de datos más elaborados.

source: It will also probe for C<futimes> (and use it internally if available), and whether C<sprintf> correctly returns the length of the formatted string.
es_es: También probará por C<futimes> (y lo usará internamente si está disponible), y también por si C<sprintf> devuelve correctamente la longitud de la cadena formateada.

source: On EBCDIC systems, the first example would be
es_es: En sistemas EBCDIC, el primer ejemplo sería

source: If the right argument is an expression rather than a search pattern, substitution, or transliteration, it is interpreted as a search pattern at run time.
es_es: Si el argumento derecho es una expresión en lugar de un patrón de búsqueda, sustitución o transliteración, se interpreta como un patrón de búsqueda en tiempo de ejecución.

source: BEGIN { require Module; Module->import( LIST ); }
es_es: BEGIN { require Módulo; Módulo->import( LISTA ); }

source: h A hex string (low nybble first).
es_es: h Una cadena hexadecimal (primero el nibble bajo).

source: When in paragraph mode (C<$/ = "">), it removes all trailing newlines from the string.
es_es: En modo párrafo (C<$/ = "">), elimina todos los caracteres de nueva línea del string.

source: Conditional expression.
es_es: Expresión condicional.

source: =item sethostent STAYOPEN
es_es: =item sethostent SIGUEABIERTO

source: See "Environment access" in the F<INSTALL> file for details.
es_es: Vea "Acceso al entorno" en el fichero F<INSTALL> para más detalles.

source: or xor | alternation \s == whitespace \b word boundary \w == word characters \z string end \d == digits
es_es: or xor | alternancia \s == espacio en blanco \b límite de palabra \w == caracteres de palabra \z fin cadena \d == dígitos

source: $#foo]; # an expensive no-op
es_es: $#foo]; # una costosa no-operación

source: In time critical applications it behooves you not to split into more fields than you really need.
es_es: En aplicaciones de tiempo crítico no es conveniente dividir en más campos de los que realmente necesita.

source: display_week();
es_es: muestra_semana();

source: Details in L</"/x">
es_es: Detalles en L</"/x">

source: use Modules; /$userinput/ perl.apache.org
es_es: use Modules; /$entrada_usuario/ perl.apache.org

source: nonassoc < > <= >= lt gt le ge
es_es: no asoc. < > <= >= lt gt le ge

source: Operator overloading allows user-defined behaviors for numbers, such as operations over arbitrarily large integers, floating points numbers with arbitrary precision, operations over "exotic" numbers such as modular arithmetic or p-adic arithmetic, and so on.
es_es: que permite establecer comportamientos definidos por el usuario para números, como operaciones con enteros arbitrariamente grandes, números de punto flotante de precisión arbitraria, operaciones con números "exóticos" (como la aritmética modular o la aritmética de números p-ádicos), etc.

source: =item System V interprocess communication functions X<IPC> X<System V> X<semaphore> X<shared memory> X<memory> X<message>
es_es: =item Funciones de comunicación interprocesos System V X<IPC> X<System V> X<semaphore> X<shared memory> X<memory> X<message> X<semáforo> X<memoria compartida> X<memoria> X<mensaje>

source: perldsc Perl data structures intro
es_es: perldsc Introducción a las estructuras de datos

source: But if you try this:
es_es: Pero si intenta esto:

source: foreach (@lines) {
es_es: foreach (@lineas) {

source: opendir(my $dh, $some_dir) || die "can't opendir $some_dir: $!";
es_es: opendir(my $dh, $algun_dir) || die "no puedo opendir $algun_dir: $!";

source: Numeric literals are specified in any of the following floating point or integer formats:
es_es: Los literales numéricos se especifican en cualquiera de los siguientes formatos de punto flotante o entero:

source: A TERM has the highest precedence in Perl.
es_es: Un TÉRMINO tiene la mayor precedencia en Perl.

source: You can actually put an array or hash anywhere in the list, but the first one in the list will soak up all the values, and anything after it will become undefined.
es_es: Usted puede poner realmente un array o hash en cualquier lugar de la lista, pero la primera en la lista absorberá todos los demás valores, y cualquier cosa después quedará indefinida.

source: Unlike C<printf>, C<sprintf> does not do what you probably mean when you pass it an array as your first argument.
es_es: A diferencia de C<printf>, C<sprintf> no hace lo que probablemente quiere decir cuando se le pasa un array como primer argumento.

source: Perl Authors Upload Server.
es_es: Servidor de subidas para los autores Perl (I<Perl Authors Upload Server>).

source: C<Text::Tabs> upgraded to version 2005.0824
es_es: C<Text::Tabs> actualizado a la versión 2005.0824

source: See L<perlsub/"Private Variables via my()"> for details.
es_es: Ver L<perlsub/"Variables privadas con my()"> para más detalles.

source: =head2 Cygwin 1.5 problems
es_es: =head2 Problemas en Cygwin 1.5

source: Use C<reverse> to do the reverse.
es_es: Utilice C<reverse> para hacer lo contrario.

source: Ignore them: in IRIX 5.3 there is no way to quieten ld about this.
es_es: No haga caso de ellos: en IRIX 5.3 no hay manera de silenciar ld a este respecto.

source: Does a fork(2) system call to create a new process running the same program at the same point.
es_es: Hace una llamada del sistema fork(2) para crear un nuevo proceso ejecutando el mismo programa en el mismo punto.

source: If there are no valid digits between the braces, the generated character is the NULL character (C<\x{00}>).
es_es: Si no hay dígitos válidos entre las llaves, el carácter generado es el carácter NULL (C<\x{00}>).

source: Binary "or" returns the logical disjunction of the two surrounding expressions.
es_es: Binario "or" devuelve la disyunción lógica de las dos expresiones que la rodean.

source: (The routines are derived (distantly) from Henry Spencer's freely redistributable reimplementation of the V8 routines.) See L<Version 8 Regular Expressions> for details.
es_es: (Las rutinas se derivan (lejanamente) de la reimplementación redistribuible de henry Spencer de las rutinas V8). Vea L<Expresiones regulares versión 8> para más detalles.

source: ($package, $filename, $line, $subroutine, $hasargs,
es_es: ($paquete, $archivo, $linea, $subritina, $hasargs,

source: When the system is large or likely to become so
es_es: Cuando el sistema es grande o que pueda llegar a serlo

source: See below for details.
es_es: Ver abajo para más detalles.

source: /the (\S+)(?{ $color = $^N }) (\S+)(?{ $animal = $^N })/i;
es_es: /el (\S+)(?{ $animal = $^N }) (\S+)(?{ $color = $^N })/i;

source: These modules have the advantage of not hiding different types of the same name during the local().
es_es: Estos módulos tienen la ventaja de no ocultar diferentes tipos del mismo nombre durante el local().

source: printf "<%*2$s>", "a", 6; # prints "< a>"
es_es: printf "<%*2$s>", "a", 6; # imprime "< a>"

source: perlnewmod Perl modules: preparing a new module for distribution
es_es: perlnewmod Preparar la distribución de un módulo Perl nuevo

source: See also L<perlipc/"SysV IPC"> and the documentation for C<IPC::SysV> and C<IPC::SysV::Msg>.
es_es: Vea también la documentación de L<perlipc/"SysV IPC"> y C<IPC::SysV> y C<IPC::SysV::Msg>.

source: "-T" is on the #!
es_es: "-T" está en la #!

source: This behaviour is now optional.
es_es: Este comportamiento es ahora opcional.

source: =item -X FILEHANDLE X<-r>X<-w>X<-x>X<-o>X<-R>X<-W>X<-X>X<-O>X<-e>X<-z>X<-s>X<-f>X<-d>X<-l>X<-p> X<-S>X<-b>X<-c>X<-t>X<-u>X<-g>X<-k>X<-T>X<-B>X<-M>X<-A>X<-C>
es_es: =item -X IDENTIFICADOR_ARCHIVO X<-r>X<-w>X<-x>X<-o>X<-R>X<-W>X<-X>X<-O>X<-e>X<-z>X<-s>X<-f>X<-d>X<-l>X<-p> X<-S>X<-b>X<-c>X<-t>X<-u>X<-g>X<-k>X<-T>X<-B>X<-M>X<-A>X<-C>

source: Consult the Usenet FAQs for your operating system for information on where to get such a binary version.
es_es: Consulte las preguntas más frecuentes de Usenet relativas a su sistema operativo para obtener más información acerca de dónde obtener esta versión binaria.

source: See also C<srand>.
es_es: Ver también C<srand>.

source: The new Perl command line option C<-C> and its counterpart environment variable PERL_UNICODE can now be used to control how Perl and Unicode interact at interfaces like I/O and for example the command line arguments.
es_es: La nueva opción de la línea de comandos de Perl C<-C> y su contrapartida en la variable de entorno PERL_UNICODE ahora se pueden utilizar para controlar la forma en que Perl y Unicode interactuan en las interfaces como E/S y, por ejemplo, los argumentos en la línea de comandos.

source: If LABEL is omitted, the command refers to the innermost enclosing loop.
es_es: Si la ETIQUETA se omite, el comando se refiere al bucle más interior en que se encuentre.

source: support BeOS better
es_es: mejor soporte para BeOS

source: You are advised to replace use of suidperl with tools such as sudo ( http://www.courtesan.com/sudo/ )
es_es: Se recomienda reemplazar el uso de suidperl con herramientas como sudo (http://www.courtesan.com/sudo/)

source: except that it isn't so cumbersome to say, and will actually work.
es_es: excepto que no es tan complicado como hemos dicho, y funciona de forma efectiva.

source: f A single-precision float in native format.
es_es: f Un flotante en simple precisión en formato nativo.

source: =head2 New modules
es_es: =head2 Nuevos módulos

source: And most of all, it must be something decodable.
es_es: También es fundamental que lo que se va a descodificar sea descodificable

source: If FILEHANDLE is supplied, sets the new current default filehandle for output.
es_es: Si se indica un IDENTIFICADOR_ARCHIVO, se establece un nuevo identificador de archivo predeterminado para la salida.

source: For example, here's one way to count how many times a particular string occurs in an array:
es_es: Por ejemplo, aquí hay una manera de contar cuántas veces aparece una cadena particular en un array:

source: He says (half in jest) that "a script is what you give the actors.
es_es: Dice (medio en broma) que "un script (guión) es lo que se le da a los actores,

source: is not the same as
es_es: no es lo mismo que

source: When in doubt, parenthesize.
es_es: En caso de duda, coloque paréntesis.

source: That's all well and good for declaration of a fixed data structure, but what if you wanted to add new elements on the fly, or build it up entirely from scratch?
es_es: Todo eso está bien y es bueno para la declaración de una estructura de datos fijos, pero ¿y si quisiera añadir nuevos elementos sobre la marcha, o construirlo desde cero?

source: http://www.perl.org/ the Perl homepage
es_es: http://www.perl.org/ página de inicio del lenguaje Perl

source: Creates a new filename linked to the old filename.
es_es: Crea un nuevo nombre de archivo enlazado con el nombre del archivo antiguo.

source: print scalar reverse "dlrow ,", "olleH"; # Hello, world
es_es: print scalar reverse "odnum ,", "aloH"; # Hola, mundo

source: with the release following soon after, when testing is complete.
es_es: con el consiguiente comunicado poco después, cuando se complete los test.

source: =head1 Modules and Pragmas
es_es: =head1 Módules y Pragmas

source: ISBN 0-321-49694-9 [2nd edition 2010]
es_es: ISBN 0-321-49694-9 [2ª edición - 2010]

source: Tru64 when using gcc 3 drops the optimisation for F<toke.c> to C<-O2> because of gigantic memory use with the default C<-O3>.
es_es: En Tru64, cuando se utiliza gcc 3 baja la optimización de F<toke.c> a C<-O2> debido al enorme uso de memoria con el valor por defecto C<-O3>.

source: There is no Perl 6 release scheduled, but it will be available when it's ready.
es_es: Aún no está prevista una fecha de lanzamiento de Perl 6. La nueva versión estará disponible cuando llegue el momento.

source: or die "$user not in passwd file";
es_es: or die "$usuario no está en archivo de contraseñas";

source: perlfaq9 Networking
es_es: perlfaq9 Conexión a redes

source: Given an expression that specifies an element or slice of a hash, C<delete> deletes the specified elements from that hash so that exists() on that element no longer returns true.
es_es: Dada una expresión que especifica un elemento o una porción de un hash, C<delete> elimina los elementos especificados de este hash de tal forma que exists() en ese elemento ya no devuelve verdadero.

source: To match the actual end of the string and not ignore an optional trailing newline, use C<\z>.
es_es: Para coincidir con el final actual de la cadena, sin ignorar un posible carácter de fin de línea, use C<\z>.

source: See also C<die>.
es_es: Ver también C<die>.

source: If new flags are added to Perl, the meaning of the caret's expansion will change to include the default for those flags, so the test will still work, unchanged.
es_es: Si las nuevas banderas son agregadas a Perl, el significado de la expansión del circunflejo cambiará para incluir el valor predeterminado para estas banderas, por lo que la prueba seguirá funcionando, sin cambios.

source: C<undef ~~ %hash> is always false (since C<undef> can't be a key in a hash).
es_es: C<undef ~~ %hash> siempre es falsa (ya que C<undef> no puede ser una clave en un hash).

source: if (/foo $parens \s+ + \s+ bar $parens/x) {
es_es: if (/foo $parentesis \s+ + \s+ bar $parentesis/x) {

source: Where do I get it?
es_es: ¿Dónde puedo obtener perl?

source: The F<Artistic> and F<Copying> files for copyright information.
es_es: Los archivos F<Artistic> y F<Copying> para ver la información sobre derechos de autor.

source: but, because * is higher precedence than named operators:
es_es: pero, debido a que * es de mayor precedencia que los operadores con nombre:

source: perl561delta Perl changes in version 5.6.1
es_es: perl561delta Cambios en la versión 5.6.1

source: Returns the number of non-leap seconds since whatever time the system considers to be the epoch, suitable for feeding to C<gmtime> and C<localtime>.
es_es: Devuelve el número de segundos no bisiestos desde el momento en que el sistema considera que es el I<epoch>, apto para ser alimentado a C<gmtime> y C<localtime>.

source: Do not wait for Perl 6 to do whatever you need to do.
es_es: No espere a que salga Perl 6 para hacer lo que tenga que hacer.

source: As noted earlier in this document, the scalar sense of list assignment is the number of elements on the right-hand side of the assignment.
es_es: Como se ha señalado anteriormente en este documento, el sentido escalar de una asignación de una lista es el número de elementos en el lado derecho de la asignación.

source: The intent is to squeeze as much possible information about the likely cause into the limited space of the system exit code.
es_es: La intención es comprimir la mayor información posible sobre la causa probable en el limitado espacio del código de salida del sistema.

source: On systems that support a close-on-exec flag on files, the flag will be set for the newly opened file descriptors, as determined by the value of $^F.
es_es: En sistemas que apoyan la bandera close-on-exec en archivos, esta bandera se establecerá para los nuevos descriptores de archivo abiertos, según lo determinado por el valor de $^F.

source: This is called when a tied hash is used in scalar context, such as
es_es: Esto se activa cuando un hash enlazado se utiliza en contexto escalar, como

source: To get the log of another base, use basic algebra: The base-N log of a number is equal to the natural log of that number divided by the natural log of N. For example:
es_es: Para obtener el logaritmo de otra base, use álgebra básica: el logaritmo de base N de un número es igual al logaritmo natural de ese número dividido por el logaritmo natural de N. Por ejemplo:

source: If there is a C<continue> BLOCK, it is always executed just before the conditional is about to be evaluated again.
es_es: Si existe un BLOQUE C<continue>, siempre es ejecutado justo antes de que la condición sea evaluada de nuevo.

source: These may look like functions, but may also look completely different.
es_es: Pueden parecerse a funciones, pero también pueden ser complementamente diferentes.

source: my $name = 'fred';
es_es: my $nombre = 'pedro';

source: A loop's LABEL is not actually a valid target for a C<goto>; it's just the name of the loop.
es_es: La ETIQUETA de un bucle no es realmente un destino válido para un C<goto>; sólo es el nombre del bucle.

source: =item mkdir FILENAME,MASK X<mkdir> X<md> X<directory, create>
es_es: =item mkdir ARCHIVO,MÁSCARA X<mkdir> X<md> X<directory, create> X<directorio, crear>

source: *this = *that;
es_es: *este = *ese;

source: [] Bracketed Character class
es_es: [] Clase carácter encorchetada

source: In the two-argument (and one-argument) form, one should replace dash (C<->) with the command.
es_es: En la forma de dos argumentos (y un argumento), debe sustituir el guión (C<->) por el comando.

source: =item wantarray X<wantarray> X<context>
es_es: =item wantarray X<wantarray> X<context> X<contexto>

source: C<hv_clear_placeholders> is now part of the perl API
es_es: C<hv_clear_placeholders> ahora es parte de la API de perl

source: eof()); # quote body
es_es: eof()); # citar el cuerpo

source: We know that these values do I<not> work under OS/390 & VM/ESA Unix and on the Macintosh; you probably don't want to use them in new code.
es_es: Sabemos que estos valores I<no> funcionan bajo OS/390 y VM/ESA Unix y en el Macintosh; es probable que no desea utilizarlos en nuevos programas.

source: (.*)(\d*) <I have 2 numbers: 53147> <>
es_es: (.*)(\d*) <Tengo 2 números: 53147> <>

source: @animals[0..2]; # gives ("camel", "llama", "owl");
es_es: @animales[0..2]; # devuelve ("camello", "llama", "búho");

source: A list of them is given at the start of L<perlfunc> and you can easily read about any given function by using C<perldoc -f I<functionname>>.
es_es: Al principio de L<perlfunc> se incluye una lista completa de funciones. También puede obtener fácilmente información sobre cualquier función mediante el comando C<perldoc -f I<nombre_función>>.

source: The wrapping defaults to enabled on platforms where we know it works (most AIX configurations, BSDi, Darwin, DEC OSF/1, FreeBSD, HP/UX, GNU Linux, OpenBSD, Solaris, VMS and most Win32 compilers) and defaults to disabled on other platforms.
es_es: La envoltura por defecto está activa en plataformas en las que sabemos que funciona (la mayoría de las configuraciones de AIX, BSDi, Darwin, DEC OSF/1, FreeBSD, HP/UX, GNU Linux, OpenBSD, Solaris, VMS y la mayor parte de los compiladores Win32) y por defecto queda desactivado en otras plataformas.

source: Too much to list here; see L<http://search.cpan.org/dist/ExtUtils-MakeMaker/Changes>
es_es: Demasiado para listarlo aquí; vea L<http://search.cpan.org/dist/ExtUtils-MakeMaker/Changes>

source: You have a DBM database that you need to share with a third-party C application.
es_es: Tiene una base de datos DBM que desea compartir con una aplicación en C de terceros.

source: =item chroot FILENAME X<chroot> X<root>
es_es: =item chroot NOMBRE_ARCHIVO X<chroot> X<root>

source: Look at the L<Digest> module for more robust algorithms.
es_es: Mire en el módulo L<Digest> por algoritmos más robustos.

source: See L<perlvar> for details on setting C<%SIG> entries and for more examples.
es_es: Vea L<perlvar> para más detalles sobre la configuración de las entradas C<%SIG> y para ver más ejemplos.

source: Each 5.005-style thread creation will trigger the warning C<5.005 threads are deprecated>.
es_es: Cada creación de un I<thread> estilo 5.005 disparará la advertencia C<5.005 threads are deprecated>.

source: The C<ext/POSIX/t/waitpid> test fails at #1.
es_es: El test C<ext/POSIX/t/waitpid> falla en el número 1.

source: =item Functions for SCALARs or strings X<scalar> X<string> X<character>
es_es: =item Functiones para ESCALARES o cadenas X<scalar> X<string> X<character> X<escalar> X<cadena> X<carácter>

source: The @ARGV array is then processed as a list of filenames.
es_es: Luego, el array @ARGV es procesado como una lista de nombres de archivo.

source: perlpodstyle Perl POD style guide
es_es: perlpodstyle Guía de estilo POD

source: Then one is added to the return value of C<print> (usually 1).
es_es: Entonces uno es añadido al valor devuelto por C<print> (generalmente 1).

source: READLINE this
es_es: READLINE este

source: Optimised C<map> in scalar context
es_es: Optimizado C<map> en contexto escalar

source: perlembed Perl ways to embed perl in your C or C++ application
es_es: perlembed Formas de integrar Perl en una aplicación C o C++

source: The C<qx/EXPR/> operator is discussed in more detail in L<perlop/"I/O Operators">.
es_es: El operador C<qx/EXPR/> se discute con más detalle en L<perlop/"Operadores E/S">.

source: If your XS module stops working because some functions cannot be found, in many cases a simple fix is to add the C<Perl_> prefix to the function and the thread context C<aTHX_> as the first argument of the function call.
es_es: Si su módulo XS deja de funcionar debido a que algunas funciones no se pueden encontrar, en muchos casos una solución sencilla es añadir el prefijo C<Perl_> a la función y el contexto del hilo C<aTHX_> como primer argumento de la llamada a la función.

source: If you evaluate an array in scalar context, it returns the length of the array.
es_es: Si se evalúa un array en un contexto escalar, éste devuelve la longitud del array.

source: A command-line front-end to C<Module::CoreList>, to query what modules were shipped with given versions of perl.
es_es: Este front-end de línea de comandos de C<Module::CoreList> permite consultar la lista de módulos incluidos en versiones específicas de perl.

source: Note also that the loop control statements described later will I<NOT> work in this construct, because modifiers don't take loop labels.
es_es: Note también que las instrucciones de control de bucles descritas más adelante I<NO> funcionarán con esta construcción, porque los modificadores no toman etiquetas de bucle.

source: X<context>
es_es: X<contexto>

source: =item continue BLOCK X<continue>
es_es: =item continue BLOQUE X<continue>

source: x string multiplication
es_es: x multiplicación de cadenas

source: C<-DL> removed (the leaktest had been broken and unsupported for years, use alternative debugging mallocs or tools like valgrind and Purify).
es_es: C<-DL> eliminado (el test de agotamiento estaba roto y no mantenido desde hace años; de otra forma, use malloc de depuración o herramientas como valgrind y Purify).

source: It cannot short-circuit (of course).
es_es: No puede cortocircuitar (por supuesto).

source: Unary "\" creates a reference to whatever follows it.
es_es: Unario "\" crea una referencia a lo que sigue.
